#include <stdio.h>
#include <locale.h>
void main()
{
	setlocale(LC_ALL, "ru_RU.UTF-8");
	printf("123\n"); //подзадание 1

	printf("1\n2\n3\n"); //подзадание 2

	printf(" 111\n\t 222\n\t\t 333\n"); //подзадание 3

	printf("%d\n\t %d\n\t\t %d\n\t\t\t %d \n", 4, 3, 2, 1); //подзадание 4

	printf("%10.3f\n ", 12.234657); // подзадание 5

	printf("%10.5f\n ", 12.234657); // подзадание 6

	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2); // подзадание 7

	printf("Остаток от деления %d на %d равен %d\n", 7, 5, 7 % 5); // подзадание 8

	printf("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4); // подзадание 9

	printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000); // подзадание 10.1

	printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000); // подзадание 10.2

	printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000); // подзадание 10.3

	printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000); // подзадание 10.4

	printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000); // подзадание 10.5

}

